import React from 'react'
import g1 from "../assets/images/woman/12.jpg"
import m1 from "../assets/images/man/5.jpg"

const Details = () => {
  return (
    <div>
      <div className='flex items-start mt-7'>
        <img className='rounded-lg w-60 object-contain' src={m1} alt="" />
        <div className='text-center'>
          <h1 className='font-moul'>មនុស្សកើតឆ្នាំឆ្លូវ (គោ)<br/> (ឆ្នាំឆ្លូវ “ធាតុដី “ ពង្សមនុស្សប្រុស)</h1>
          <p className='p-5 text-left'>មនុស្សប្រុស-ស្រីណា កើតឆ្នាំនេះ ទំនាយទាយថា មានគេស្រឡាញ់រាប់អានច្រើន តែច្រើន អភ័ព្វគ្គគ្រង ចិត្តច្រើនរវើរវាយ បើរកស៊ីជំនួញជួញដូរ នឹងបានផលមធ្យម បើធ្វើកិច្ចការរដ្ឋច្រើនបាន បុណ្យស័ក្តិតូចល្មម ជាមនុស្សចូលចិត្តស្នេហា និងចូលចិត្តដើរលេងច្រើន។ មនុស្សកើតឆ្នាំនេះ រមែងជាមនុស្សមានគំនិតប្រាជ្ញាវៀងវៃសំដ៏និយាយមោះមុត មានគេគោរព កោតក្រែងច្រើន ជាមនុស្សមានចិត្តបុណ្យកុសល ចូលចិត្តជួយដោះទុក្ខអ្នកមានអាសន្ន មាននិស្ស័យ សុភាពទន់ភ្លន់ តែមិនសូវអើពើនិងញាតិសន្តាន ឆ្លាតខាងនិយាយកំប្លែង ឆេវឆាវ ឆាប់ខឹងតែឆាប់បាត់ រញាំរញី ពេញចិត្តក្នុងកាមារម្មណ៍ច្រើន បងប្អូនញាតិមិត្តពឹងពាក់ពុំសូវបាន។ កាលគឺនៅក្មងលំបាក វេទនាច្រើន តែងនិរាសចាកចោលស្រុកកំណើត និង ឱពុកម្ដាយទៅនៅទីឆ្ងាយ លុះដល់វ័យចាស់ទៅ ទើបមានបានសម្បូណ៌ហូរហៀរទៅដោយភោគទ្រព្យ និងខ្ញុំកំដរបរិវារ។ មុខរបរដែលស័ក្តិសមជាងគេសម្រាប់មនុស្សកើតឆ្នាំឆ្លូវនេះគឺ ៖ ពេទ្យ មេធាវី ឬ ការងាររដ្ឋការ ដែលទាក់ទងទៅនឹងផ្នែករដ្ឋបាល បើធ្វើស្រែចំការ ការងារដែលយកកម្លាំងកាយ ទៅប្តូរច្រើនតែពុំសូវ បានផលល្អ បើសេពគប់សមណៈ និង មានកិត្តិសព្ទល្អ ។</p>
        </div>
        <img className='rounded-lg w-60 object-contain' src={g1} alt="" />
      </div>
    </div>
  )
}

export default Details